{
    "dataset_params": {
        "class_name": "H5Reader",
        "config": {
            "filename": "/home/work/sofiek/hn_delin/full_dataset_singleclass.h5",
            "batch_size": 16,
            "x_name": "input",
            "y_name": "target",
            "batch_cache": 10,
            "shuffle": true,
            "fold_prefix": "",
            "train_folds": [
                "train"
            ],
            "val_folds": [
                "val"
            ],
            "test_folds": [
                "test"
            ],
            "preprocessors": [
                {
                    "class_name": "HounsfieldWindowingPreprocessor",
                    "config": {
                        "window_center": 70,
                        "window_width": 200,
                        "channel": 0
                    }
                },
                {
                    "class_name": "ImageNormalizerPreprocessor",
                    "config": {
                        "vmin": [
                            -100,
                            0
                        ],
                        "vmax": [
                            100,
                            25
                        ]
                    }
                }
            ],
            "augmentations": {
                "class_name": "ImageAugmentation2D",
                "config": {
                    "rotation_range": 90,
                    "zoom_range": [
                        0.8,
                        1.2
                    ],
                    "shift_range": [
                        10,
                        10
                    ],
                    "flip_axis": 0,
                    "brightness_range": [
                        0.8,
                        1.2
                    ],
                    "contrast_range": [
                        0.7,
                        1.3
                    ],
                    "noise_variance": 0.05,
                    "noise_channel": 1,
                    "blur_range": [
                        0.5,
                        1.5
                    ],
                    "blur_channel": 1
                }
            }
        }
    },
    "train_params": {
        "epochs": 5,
        "callbacks": [
            {
                "class_name": "EarlyStopping",
                "config": {
                    "monitor": "val_loss",
                    "patience": 30
                }
            }
        ]
    },
    "input_params": {
        "shape": [
            191,
            265,
            2
        ]
    },
    "model_params": {
        "loss": {
            "class_name": "BinaryFbetaLoss"
        },
        "optimizer": {
            "class_name": "adam",
            "config": {
                "learning_rate": 0.0001
            }
        },
        "metrics": [
            {
                "class_name": "BinaryFbeta"
            },
            {
                "class_name": "Dice"
            }
        ]
    },
    "architecture": {"type": "ResNet", "layers": [{"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "pool1", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "pool2", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "pool3", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "upconv2", "class_name": "Conv2DTranspose", "config": {"filters": 80, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["pool2", "upconv2"]}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "upconv1", "class_name": "Conv2DTranspose", "config": {"filters": 80, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["pool1", "upconv1"]}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2DTranspose", "config": {"filters": 80, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "resize_inputs": true}, {"class_name": "Conv2D", "config": {"filters": 80, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": 3, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}
}